package course47;

class Enshu10 {

	public static void main(String[] args) {
		String[][] typeArray = {
				{ "くさ", "みず"},
				{ "くさ", "じめん"},
				{ "くさ", "いわ"},
				{ "どく", "くさ"},
				{ "どく", "むし"},
				{ "エスパー", "かくとう"},
				{ "エスパー", "どく"},
				{ "こおり", "くさ"},
				{ "こおり", "じめん"},
				{ "こおり", "ひこう"},
				{ "こおり", "ドラゴン"},
				{ "ほのお", "くさ"},
				{ "ほのお", "こおり"},
				{ "ほのお", "むし"},
				{ "かくとう", "ノーマル"},
				{ "かくとう", "こおり"},
				{ "かくとう", "いわ"},
				{ "いわ", "ほのお"},
				{ "いわ", "こおり"},
				{ "いわ", "ひこう"},
				{ "いわ", "むし"},
				{ "じめん", "ほのお"},
				{ "じめん", "でんき"},
				{ "じめん", "どく"},
				{ "じめん", "いわ"},
				{ "むし", "くさ"},
				{ "むし", "どく"},
				{ "むし", "エスパー"},
				{ "ゴースト", "ゴースト"},
				{ "でんき", "みず"},
				{ "でんき", "ひこう"},
				{ "みず", "ほのお"},
				{ "みず", "じめん"},
				{ "みず", "いわ"},
				{ "ひこう", "くさ"},
				{ "ひこう", "かくとう"},
				{ "ひこう", "むし"},
		};

	}
}
